# 建立學生資料陣列：姓名、國文、英文、數學、總分（初始為 0）
sc = [
    ["建富1號", 80, 95, 88, 0],
    ["建富2號", 98, 97, 96, 0],
    ["建富3號", 91, 93, 95, 0],
    ["建富4號", 92, 94, 90, 0],
    ["建富5號", 92, 97, 80, 0]
]

# 這邊我要去將每個學生的總分算出來
# 我們可以先以建富1號做實驗

# print(sc[0][1])
# print(sc[0][2])
# print(sc[0][3])
# print(sc[0][1:4])
# print(sum(sc[0][1:4]))
# sc[0][4] = sum(sc[0][1:4])
# print(sc[0][4])

# 重複，使用迴圈
# sc[0][4] = sum(sc[0][1:4])
# sc[1][4] = sum(sc[1][1:4])
# sc[2][4] = sum(sc[2][1:4])
# sc[3][4] = sum(sc[3][1:4])
# sc[4][4] = sum(sc[4][1:4])